#  To install on new machine:
# > brew bundle install
#
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

tap "aws/tap"
tap "nikitabobko/tap"
# Code searching, linting, rewriting
brew "ast-grep"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Small git utilities
brew "git-extras"
# Simple terminal UI for git commands
brew "lazygit"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Prettier daemon
brew "prettierd"
# Python version management
brew "pyenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"

# JetBrains Mono NL
cask "font-jetbrains-mono-nerd-font"

# Golang
brew "go"

# My apps
cask "zed"
cask "obsidian"
cask "cleanshot"
cask "bitwarden"
